Repository: mozilla-l10n/mt-training-data
Catalog: quc/quc_pontoon.tmx
Source language: en_us
Languages: quc

source: %1$s is free and open source software made by Mozilla and other contributors.
quc: %1$s are jun cholwach le man k'o ta jaqatal retokib'al winaqirisam rumal Mozilla chi'l nik'aj chi tob'anelab'.

source: %1$s is made available to you under the terms of the <a href="%2$s">Mozilla Public License</a> and other open source licenses.
quc: %1$s b'anom chi k'o chi awech at are tzij taq taqanem rech le <a href="%2$s">Kemwujil rech Mozilla rech uk'iyal</a> chi'l nik'aj chi jaqatal uxe'al taq kemwujil.

source: About
quc: Chi rij

source: About %1$s
quc: Chi rij %1$s

source: About %1$s, help
quc: Chi rij %1$s, tob'anem

source: Add
quc: Uya'ik

source: Add and manage custom autocomplete URLs.
quc: Chaya' chi'l chawilawachij winaqirisam utz'aqatisaxik pa utukelam URLs.

source: + Add another search engine
quc: + Chaya' jun chi ch'ich' rech tzukub'al

source: + Add custom URL
quc: + Uya'ik winaqirisam URL

source: Add custom URL
quc: Uya'ik winaqirisam URL

source: Additional source code for %1$s is available under various other free and open source <a href="%2$s">licenses</a>.
quc: Utz'aqatil uxe'al retokib'al chech %1$s k'o chi uxe' pa k'i nik'aj chi jaqatal sipatal taq uxe'al <a href="%2$s">taq kemwujil</a>.

source: Add search engine
quc: Chaya' ch'ich' rech tzukub'al

source: Add shortcuts to your home screen
quc: Chaya' taq ramb'al b'e pa le umajib'al q'axwach

source: Add to Home screen
quc: Chaya' pa umajib'al q'axwach

source: An installed search engine is already using that name.
quc: Jun jeqeb'am ch'ich' rech tzukub'al ktajin chi kukoj la' le b'i'aj.

source: Authentication required
quc: Kajawataj usaqil tzij

source: Autocomplete
quc: Utz'aqatisaxik pa utukelam

source: Automatic private browsing. Browse. Erase. Repeat.
quc: Nik'onem rech echeb'alil pa utukelam. Utzukuxik. Uyujik. Ukamulixik.

source: Block 3rd-party cookies only
quc: Xew chaq'atej cookies kech 3urox

source: Block ad trackers
quc: Q'ateb'al chi'l taq tzukub'al

source: Block analytic trackers
quc: Chaq'atej taq k'oxomab'al rech taq tzukub'al

source: Block cookies
quc: Chaq'atej cookies

source: Block JavaScript
quc: Uq'atexik JavaScript

source: Block other content trackers
quc: Chaq'atej nik'aj chi taq tzukub'al upam chak

source: Block social trackers
quc: Uq'atexik taq tzukub'al rech uk'iyal

source: Block trackers
quc: Uq'atexik taq tzukub'al

source: Block Web fonts
quc: Uq'atexik taq tz'ib' rech web'

source: Cancel
quc: Uq'atexik

source: Check that search string matches Example format
quc: Chaq'atuj chi le cholaj tzij rech tzukunem kjunamataj ruk' le k'amwach rech k'utub'al

source: Clear
quc: Uchupik

source: Clear input
quc: Q'alaj okib'al

source: Cookies and Site Data
quc: Cookies chi'l taq juq'attzij rech wokk'olib'al web'

source: Copy image address
quc: Chawelesaj uwach ukemriqonib'al wachib'al

source: Copy link address
quc: Chawelesaj uwach le ukemriqonib'al kemwiqb'al

source: Custom URLs
quc: Winaqirisam URLs

source: Data Choices
quc: Jalajoj ucha'ik rech juq'attzij

source: Data Collection & Use
quc: Mulib'al rech juq'attzij chi'l ukojik

source: Default
quc: Ya'om chi uloq

source: Default URL List
quc: Ucholajil URL ya'om chi uloq

source: Dismiss
quc: Relesaxik

source: Dismiss find in page
quc: Man kriqitaj ta pa uxaq wuj

source: Double-check the URL you entered.
quc: Kamul chaq'atuj le URL le xatz'ib'aj.

source: Download
quc: Taq uqasaxik

source: Downloaded files <b>will not be deleted</b> when you erase %1$s history.
quc: Taq kemk'olib'al qasam <b>man kchupisax taj</b> are taq kachup %1$s b'antal kanoq.

source: Download File
quc: Chaqasaj kemk'olib'al

source: Download Firefox
quc: Chaqasaj Firefox

source: Embedded on sites to track your visits and to display functionality like share buttons
quc: Wiqital pa taq wokk'olib'al web' chech uterene'xik taq solinem chi'l chech uk'utunsaxik taq chakunem pacha' taq pitz'b'al rech ukomone'xik

source: Enable to have %1$s autocomplete over 450 popular URLs in the address bar.
quc: Chatzija' chech uriqik %1$s utz'aqatisaxik pa utukelam kq'ax pa uwi' 450 qas eta'matal URLs pa le uq'e'tb'al kemriqonib'al.

source: Enabling may cause some pages to behave unexpectedly
quc: Le utzijik wene kub'ano chi jujun taq uxaq wuj man eye'tal ta le kkib'ano

source: Enter search engine name
quc: Chatz'ib'aj ub'i' ch'ich' rech tzukub'al

source: Enter search string
quc: Chatz'ib'aj cholaj tzij rech tzukunem

source: Erase
quc: Uyujik

source: Erase and Open
quc: Uchupik chi'l ujaqik

source: Erase browsing history
quc: Uchupik nik'ob'al rech b'antal kanoq

source: Example: example.com
quc: K'utb'al: example.com

source: Example: example.com/search/?q=%s
quc: K'utub'al: example.com/search/?q=%s

source: Example: mozilla.org
quc: K'utb'al: mozilla.org

source: Exit Private Browsing?
quc: ¿Kawaj katel pa Nik'ob'al rech echeb'alil?

source: Find an app that can open link
quc: Chariqa' jun kemwiqb'al le kkowinik kujaq kemwiqb'al

source: Find in page
quc: Uriqik pa uxaq wuj

source: Find in Page
quc: Uriqik pa uxaq wuj

source: Find next result
quc: Chariqa' uwachinem teren chi uloq

source: Find previous result
quc: Chariqa' uwachinem kanoq

source: General
quc: Chi ronojel

source: Help
quc: Tob'anem

source: Hide webpages when switching apps
quc: Rowaxik taq uxaq web' are taq kk'ex taq kojkemchak

source: Hide webpages when switching apps and block taking screenshots.
quc: Rowaxik taq uxaq web' are taq kk'ex taq kojkemchak.

source: Insecure Connection
quc: Man chajital ta t'iqonem

source: Installed search engines
quc: Jeqeb'am taq ch'ich' rech tzukunem

source: Language
quc: Ch'ab'al

source: Learn more
quc: Chaweta'maj nik'aj chik

source: Loading
quc: Ktajin uya'ik uchuq'ab'

source: Make %1$s default browser
quc: Chab'ana' %1$s nik'ob'al ya'om chi uloq

source: Make privacy a habit
quc: Chab'ana' jun amaq'el ub'anik chech le echeb'alil

source: May result in missing icons or images
quc: Wene kub'ano chi ke'etzaq taq retno'jib'al on taq wachib'al

source: More options
quc: Nik'aj chi Jalajoj taq ucha'ik

source: Mozilla strives to collect only what we need to provide and improve %1$s for everyone.
quc: Le Mozilla kukoj uchuq'ab' chech umulixik xew le rajawaxik kya'ik chi'l uk'exsuk'umaxik %1$s chi kech konojel.

source: Navigate back
quc: Nik'onem chi rij

source: Navigate forward
quc: Nik'onem chi uwach

source: New custom URL added.
quc: K'ak' winaqirisam URL ya'om.

source: New search engine added.
quc: K'ak' ch'ich' rech tzukub'al ya'om.

source: Next
quc: Le teren chi uloq

source: No
quc: Ja'i'

source: None of the apps on your device are able to open this link. You can leave %1$s to search %2$s for an app that can.
quc: Man k'o ta jun chi kech taq kojkemchak pa le awiqkemchakub'al kkowinik kujaq we kemwiqb'al, utz kaya' kan %1$s chech utzukuxik %2$s jun kojkemchak le kkowinik.

source: Notifications let you erase your %1$s session with a tap. You don’t need to open the app or see what’s running in your browser.
quc: Le taq Ub'ixikil kuya' b'e kachup le %1$s kemchak ruk' jun pitz'onik. Man rajawaxik taj kajaq le kojkemchak on kawilo jas ktajin kub'an le anik'onel.

source: Off
quc: Uchupik

source: OK
quc: Uk'amik

source: OK, got it!
quc: Utz, ¡xink'oxomaj!

source: On
quc: Utzijik

source: Oops
quc: Amalay

source: Open
quc: Ujaqik

source: Open in…
quc: Ujaqil pa…

source: Open in %1$s
quc: Ujaqik pa %1$s

source: Open link in another app
quc: Chajaqa' kemwiqb'al pa jun chi kojkemchak

source: Open link in new tab
quc: Chajaqa' kemwiqb'al pa jun k'ak' k'utjaqb'al

source: <p>%1$s puts you in control.</p> <p>Use it as a private browser: <ul> <li>Search and browse right in the app</li> <li>Block trackers (or update settings to allow trackers)</li> <li>Erase to delete cookies as well as search and browsing history</li> </ul> </p> <p>%1$s is produced by Mozilla. Our mission is to foster a healthy, open Internet.<br/> <a href="%2$s">Learn more</a></p>
quc: <p>%1$s kuya' rilawachixik chi awech.</p> <p>Chakojo' pacha' nik'ob'al rech echeb'alil: <ul> <li>Chatzukuj chi'l chanik'oj pa le kojkemchak:</li> <li>Che'aq'atej taq tzukub'al (on chak'ak'arisaj taq wiqitajem chech uya'ik b'e chi kech taq tzukub'al)</li> <li>Chayuju' chech kichupik cookies chi'l utzukuxik chi'l unik'oxik b'antal kanoq</li> </ul> </p> <p>%1$s are b'anowinaq le Mozilla. Le qachak are uya'ik jun utzalaj, ujaqik kemk'atz.<br/> <a href="%2$s">Chaweta'maj nik'aj chik</a></p>

source: Pages may load faster, but may also behave unexpectedly
quc: Le taq uxaq wuj wene aninaq uya'ik uchuq'ab' , xa kut wene man eye'tal ta le kkib'ano

source: Paste or enter URL
quc: Chanak'a' on chatz'ib'aj URL

source: Performance
quc: Chakunem

source: Powered by %1$s
quc: Ya'om uchuq'ab' rumal %1$s

source: Power up your privacy
quc: Chaya' uchuq'ab' le awecheb'alil

source: Privacy
quc: Echeb'alil

source: Privacy Notice
quc: Ub'ixikil rech echeb'alil

source: Privacy & Security
quc: Echeb'alil chi'l chajinem

source: Private browsing session
quc: Kemchak rech echeb'alil tzukub'al

source: Problem loading page
quc: K'axk'olil rech uya'ik uchuq'ab' uxaq wuj

source: Reload website
quc: Uya'ik chi jumul uchuq'ab' wokk'olib'al web'

source: Remove
quc: Relesaxik

source: Remove custom URLs
quc: Chawelesaj winaqirisam URLs

source: Remove search engines
quc: Chawelesaj taq ch'ich' rech tzukub'al

source: Report Site Issue
quc: Ub'ixikil rech k'axk'olil rech wokk'olib'al web'

source: Request desktop site
quc: Tz'onoj rech wokk'olib'al web' rech ilwach chak

source: Restore default search engines
quc: Utzalijisaxik taq ch'ich' rech tzukunem ya'om chi uloq

source: Return to previous app
quc: Tzalijem pa kojkemchak kanoq

source: Return to your favorite sites in %1$s quickly. Just select "Add to Home screen" from the %1$s menu.
quc: Chattzalija pa taq ajawatal taq wokk'olib'al web' pa %1$s aninaq. Xew chacha' "Uya'ik pa umajib'al q'axwach" pa le %1$s cholokib'al.

source: Save
quc: Uk'olik

source: Saved and shared images <b>will not be deleted</b> when you erase %1$s history.
quc: Chak'olo' chi'l chakomone'j taq wachib'al <b>man kchupixax taj</b> are taq kachupu %1$s b'antal kanoq.

source: Save image
quc: Chak'olo' wachib'al

source: Search
quc: Utzukuxik

source: Search engine name
quc: Chatzukuj ub'i' ch'ich'

source: Search for %1$s
quc: Chatzukuj chech %1$s

source: Searching for something different? Choose another default search engine in Settings.
quc: ¿Ktajin katzukuj jalan taq jastaq? Chacha' jun chi chi'ch' rech tzukunem ya'om chi uloq pa taq suk'manem.

source: Search or enter address
quc: Utzukuxik on rokisaxik kemriqonib'al

source: Search Privately
quc: Utzukuxik pa echeb'alil

source: Search string to use
quc: Chatzukuj jucholaj tzij chech ukojik

source: Secure connection
quc: Chajital chajinem

source: Secure Connection
quc: Chajital t'iqonem

source: Secure connection failed
quc: Man utz ta xub'an le chajital t'iqonem

source: Send usage data
quc: Utaqik taq juq'attzij rech ukojik

source: Server not found
quc: Man kriqitaj ta le kempatanel

source: Set %1$s as your default browser and get the benefits of private browsing when you open webpages from other apps.
quc: Chaya' %1$s pacha' anik'onel ya'om chi uloq chi'l chariqa' le tob'anem rech nik'onem rech echeb'alil are taq kajaq taq uxaq web' pa nik'aj chi taq kojkemchak.

source: Set default, autocomplete
quc: Uya'ik pa ya'om chi uloq, utz'aqatisaxik pa utukelam

source: Settings
quc: Taq wiqitajem

source: Share…
quc: Ukomone'xik…

source: Share image
quc: Ukomone'xik wachib'al

source: Share link
quc: Ukomone'xik kemwiqb'al

source: Share via
quc: Ukomone'xik pa

source: Shortcut will open with Tracking Protection disabled
quc: Le suk'um okib'al kjaqataj ruk' Chajinem rech chupum tzukub'al

source: Site Security
quc: Chajital wokk'olib'al web'

source: Skip
quc: Relesaxik

source: Some ads track site visits, even if you don’t click the ads
quc: Jujun taq ukemtzijob'exik kkiterene'j rij taq solinem pa taq wokk'olib'al web', pine' man kapitz' ta pa taq ukemtzijob'exik

source: Stealth
quc: Man q'alaj taj

source: Stop loading website
quc: Uq'atab'axik uya'ik uchuq'ab' uk'olib'al web'

source: Switching Apps
quc: Uk'exik taq kojkemchak

source: System default
quc: Wokchakub'al ya'om chi uloq

source: Tabs open: %1$s
quc: Jaqatal taq k'utjaqb'al: %1$s

source: Take private browsing to the next level. Block ads and other content that can track you across sites and bog down page load times.
quc: Chak'ama' b'i le nik'ob'al rech echeb'alil pa le jun chi cholajil. Che'aq'atej taq ukemtzijob'exik chi'l jun chi upam chak le kkowinik ktzukun pa taq kemk'olib'al web' chi'l kuq'atej taq ukanil uya'ik uchuq'ab' uxaq wuj.

source: The address isn’t valid
quc: Le kemriqonib'al man utz taj

source: The address wasn’t understood
quc: Man xk'oxomax ta le kemriqonib'al

source: The connection timed out
quc: Le t'iqonem xq'ax uq'ijol

source: The page isn’t redirecting properly
quc: Le uxaq wuj man utz ta ub'e'ik ktajin kub'ano

source: Trackers blocked
quc: Q'atetal taq tzukub'al

source: Tracking, cookies, data choices
quc: Tzukunem, cookies, jalajoj ucha'ik rech taq juq'attzij

source: Tracking Protection
quc: Chajib'al rech tzukub'al

source: Try Again
quc: Chab'ana' chi jumul

source: <ul> <li>Check the address for typing errors such as <strong>ww</strong>.example.com instead of <strong>www</strong>.example.com</li> <li>If you are unable to load any pages, check your device’s data or Wi-Fi connection.</li> </ul>
quc: <ul> <li>Chaq'atuj le kemriqonib'al ruk' utz'ib'axik taq k'axk'olil pacha' <strong>ww</strong>.example.com chi uwach <strong>www</strong>.example.com</li> <li>We man katkowin taj kaya' uchuq'ab' apachike uxaq wuj, chaq'atuj le juq'attzij rech awiqkemchakub'al on t'iqonem rech.</li> </ul>

source: <ul> <li>The site could be temporarily unavailable or too busy. Try again in a few moments.</li> <li>If you are unable to load any pages, check your mobile device’s data or Wi-Fi connection.</li> </ul>
quc: <ul> <li>Le wokk'olib'al web' wene man jamal ta uwach on sib'alaj latz' uwach. Chab'ana' chi jumul pa jutz'it.</li> <li>We man katkowin taj kaya' uchuq'ab' apachike taq uxaq wuj, chaq'atuj le ujuq'attzij taq awiqkemchakub'al on ut'iqonem Wi-Fi .</li> </ul>

source: <ul> <li>This could be a problem with the server’s configuration, or it could be someone trying to impersonate the server.</li> <li>If you have connected to this server successfully in the past, the error may be temporary, and you can try again later.</li> </ul>
quc: <ul> <li>Wa' wene kuya' k'eyowal ruk' le suk'manem rech kempatanel, on wene are jun le kraj kukoj rib' chi kempatane.l</li> <li>We utz ub'anom le at'iqonem ruk' we kempatanel le ub'anom kanoq, le k'axk'olil wene xa ch'ikital uq'ijol, chi'l utz kanb'an chi jumul pa jutz'it.</li> </ul>

source: <ul> <li>This problem can sometimes be caused by disabling or refusing to accept cookies.</li> </ul>
quc: <ul> <li>We k'eyowal k'or are kya'ow le uchupik on le man kajawataj ta uk'amik cookies.</li> </ul>

source: <ul> <li>Web addresses are usually written like <strong>http://www.example.com/</strong></li> <li>Make sure that you’re using forward slashes (i.e. <strong>/</strong>).</li> </ul>
quc: <ul> <li>Le taq kemriqonib'al rech taq Web' nima amaq'el tz'ib'atal pacha' <strong>http://www.example.com/</strong></li> <li>Qas chawila' chi ktajin kakoj q'e'l jeqk'utb'al (i.e. <strong>/</strong>).</li> </ul>

source: <ul> <li>You might need to install other software to open this address.</li> </ul>
quc: <ul> <li>Wene rajawaxik kajeqeb'a' jun chi cholwach.</li> </ul>

source: Unable to connect
quc: Man kkowinb'ex ta ut'iqik

source: URL already exists
quc: URL k'o chik

source: URL Autocomplete
quc: Utz'aqatisaxik pa utukelam URL

source: URL copied
quc: Elesam uwach URL

source: URL to add
quc: URL chech uya'ik

source: Used to collect, analyze and measure activities like tapping and scrolling
quc: Kkoj chech umulixik, uk'oxomaxik, chi'l retaxik taq b'anowem pacha' tz'ib'anem chi'l silob'em

source: Username
quc: Ub'i' rajaw

source: Verified by: %1$s
quc: Q'atum rumal: %1$s

source: Web Content
quc: Upam chak rech web'

source: Website loaded
quc: Wokk'olib'al web' ya'om uchuq'ab'

source: We can’t load this page for some reason.
quc: Jas na k'u che man kojkowin taj kqaya' uchuq'ab' we uxaq wuj.

source: What's New
quc: Jas k'ak'

source: Yes
quc: Je'

source: You are not granted any rights or licenses to the trademarks of the Mozilla Foundation or any party, including the Mozilla, Firefox or %1$s names or logos. Additional information may be found <a href="%2$s">here</a>.
quc: Man kaya' ta chi awech taq ya'talil chi'l taq uwujil etal rech k'ayinem rech Mozilla Foundation on ni jun chi kech taq utz'aqatil, rachi'l le Mozilla, Firefox on %1$s taq b'i'aj on taq retwokaj. Le utz'aqatil q'alajisanem wene kriqitaj <a href="%2$s">waral</a>.

source: You can leave %1$s to open this link in %2$s.
quc: Utz kaya' kan %1$s chech ujaqik we kemwiqb'al pa %2$s.

source: Your browsing history has been erased.
quc: Le atzukub'al rech b'anatal kanoq xchupisaxik.

source: Your Rights
quc: Taq Aya'talil

source: Your search, your way
quc: Le atzukunem, le a b'e

source: Continue with this browser
quc: Chab'ana' na ruk' we nik'onel

source: Copy link
quc: Relesaxik uwach kemwiqb'al

source: Copy the link to open in another browser
quc: Chawelesaj uwach le kemwiqb'al chech ujaqik jun chi nik'onel

source: Copy the link to share your file:
quc: Chawinaqirisaj uwach le kemwiqb'al chech ukomone'xik le akemk'olib'al:

source: Create a { -firefox } Account or sign in
quc: Chawinaqirisaj jun { -firefox } kemb'i'aj on chamajij kemchak

source: Decrypting…
quc: Usolik…

source: Delete
quc: Uchupik

source: Download complete
quc: Tz'aqat uqasaxik

source: Download files
quc: Uqasaxik taq kemwiqb'al

source: Download { -firefox }
quc: Uqasaxik { -firefox }

source: Downloading
quc: Ktajin uqasaxik

source: Download “{ $name }” with { -send-brand }: simple, safe file sharing
quc: Chaqasaj “{ $name }” ruk' { -send-brand }: man k'ax ta ub'anik, ukomone'xik kemk'olib'al pa chajib'al

source: Drag and drop files
quc: Uchararexik chi'l utzoqopixik taq kemk'olib'al

source: Encrypting…
quc: Uwiqik…

source: Enter your email
quc: Chach'apa' le ataqoqxa'nib'al

source: Expires after { $downloadCount } or { $timespan }
quc: Kq'ax uq'ijol chi rij { $downloadCount } on { $timespan }

source: Feedback
quc: Utzijoxik

source: Firefox Send requires JavaScript
quc: Le Firefox Send kajawataj JavaScript chech

source: Importing…
quc: Ujek'ik…

source: Incorrect password. Try again.
quc: Man utz ta le retokib'al. Chab'ana' chi jumul.

source: Keep links active for up to { $count } days
quc: Chatzija' taq kemwiqb'al are chi kq'ax pa uwi' { $count } taq q'ij

source: Learn about other { -mozilla } services
quc: Chaweta'maj chi rij jun chi { -mozilla } taq patanib'al

source: Legal
quc: Nim wuj

source: Link expired
quc: Xq'ax uq'ijol kemwiqb'al

source: Manage shared files from any device
quc: Chawilawachij komone'tal taq kemk'olib'al pa apachike wiqkemchakub'al

source: Maximum password length: { $length }
quc: Nimalaj unimal retokib'al: { $length }

source: { $num } days
quc: { $num } taq q'ij

source: { $num } downloads
quc: { $num } taq uqasaxik

source: { $num } files
quc: { $num } taq kemk'olib'al

source: { $num } hours
quc: { $num } taq ramaj

source: { $num } minutes
quc: { $num } taq kajb'al

source: { $num } weeks
quc: { $num } taq wuqq'ij

source: Only { $count } archives are allowed.
quc: Xew { $count } taq kemk'olib'al ya'om b'e chech

source: Only { $count } files can be uploaded at a time.
quc: Xew { $count } taq kemk'olib'al kkowinb'ex upaqab'isaxik pa jun uq'ijol.

source: or click to send up to { $size }
quc: on chapitz'a' chech utaqik chech { $size }

source: ({ $partialSize } of { $totalSize })
quc: ({ $partialSize } rech { $totalSize })

source: Please enable JavaScript and try again.
quc: Chatzija' JavaScript k'ate k'u ri' chab'ana' chi jumul.

source: Protect with password
quc: Chajital rumal retokib'al

source: Select files to upload
quc: Ucha'ik taq kemk'olib'al chech upaqab'isaxik

source: Send
quc: Utaqik

source: { -send-brand } lets you share files with end-to-end encryption and a link that automatically expires. So you can keep what you share private and make sure your stuff doesn’t stay online forever.
quc: { -send-brand } kuya' bé chi awech kakomonej taq kemk'olib'al ruk' wiqitajem chi'l jun kemwiqb'al le kq'ax uq'ijol pa utukelam. Are chi man katzaq ta le kakomone'j pa echeb'alil chi'l chasuk'ub'a' rilik chi le taq ajastaq man kk'oji' ta pa nimk'atz pa junelik.

source: { -send-brand } will not work with this browser. { -send-short-brand } works best with the latest version of { -firefox }, and will work with the current version of most browsers.
quc: { -send-brand } man kchakun ta ruk' we nik'onel. { -send-short-brand } are qas utz uchakunem ruk' le maja naj okib'al rech { -firefox }, xuquje' kchakun ruk' le okib'al rech chanim rech nima ronojel taq nik'onelab'.

source: { -send-short-brand } is brought to you by the all-new { -firefox }.
quc: { -send-short-brand } k'amom la chi awech rumal le k'ak' { -firefox }.

source: { -send-short-brand } Privacy Notice
quc: { -send-short-brand } ub'ixikil rech echeb'alil

source: Share files up to { $size }
quc: Chakomone'j taq kemk'olib'al kq'ax pa uwi' { $size }

source: Share files with more people
quc: Chakomone'j taq kemk'olib'al kuk' nik'aj chi winaq

source: Share the link to your file:
quc: Chakomone'j le kemwiqb'al chech le akemk'olib'al:

source: Sign in to send up to { $size }
quc: Chamajij kemchak chech utaqik chech { $size }

source: Sign out
quc: Chatz'apij kemchak

source: Simple, private file sharing
quc: Man k'ax taj, ukomonexik taq kemk'olib'al pa echeb'alil

source: Something went wrong!
quc: K'o man utz ta xub'ano

source: That file is too big to upload. It should be less than { $size }
quc: Le kemk'olib'al sib'alaj nim chech upaqab'isaxik. Rajawaxik nitz' chi uwach{ $size }

source: There is a way to protect your privacy. Join Firefox.
quc: K'o jun ub'e'al chech uchajixik le a'echeb'alil. Chat'iqa' awib' pa. Firefox.

source: This browser might not be able to decrypt a file this big.
quc: We nik'onel wene man kkowin taj kusol jun jewa' unimal kemk'olib'al

source: This file was shared via { -send-brand } with end-to-end encryption and a link that automatically expires.
quc: We kemk'olib'al xkomone'x pa { -send-brand } ruk' wiqitajem pa xkut chi xkut chi'l jun kemwiqb'al le kq'ax uq'ijol pa utukelam.

source: This link has expired.
quc: Xq'ax uq'ijol we kemwiqb'al

source: This password could not be set
quc: Man kkowimb'ex ta ujeqeb'axik le retokib'al

source: Total size: { $size }
quc: Ronojel unimal: { $size }

source: Try Firefox Send
quc: Chak'amb'ejaj Firefox Send

source: Try our favorite browser
quc: Chak'amb'ejaj le ajawatal nik'onel

source: Try { -send-brand } for simple, safe file sharing.
quc: Chak'amb'ejaj { -send-brand } chech man k'ax taj, ukomonexik kemk'olib'al pa chajib'al.

source: Unfortunately this version of Firefox does not support the web technology that powers Firefox Send. You’ll need to update your browser.
quc: Chakuyu' we okib'al rech Firefox man kutoq'aj ta le k'ak'eta'm rech web' le kuya' uchuq'ab' Firefox Send. Rajawaxik kak'ak'arisaj le anik'onel.

source: Unlock
quc: Utzoqopixik

source: Update Firefox
quc: Chak'ak'arisaj Firefox

source: Upload
quc: Upaqab'isaxik

source: Version 1.0, dated March 12, 2019
quc: Okib'al 1.0, uq'ijol rech urox ik' 12, 2019

source: Why does Firefox Send require JavaScript?
quc: ¿jasche kajawataj JavaScript chech Firefox Send?

source: Why is my browser not supported?
quc: ¿Jasche man toq'am ta le nunik'onel?
